Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
void setCurrentState(const ledDescription_t& led) {
    char* url = nullptr;
    String urlString;
    String payload;
    if (led.device == Compressor) {
        url = getPGMString(urlPutCompressor);
        urlString = String(url);
    } else {
        url = getPGMString(urlPutLight);
        urlString = String(url) + led.name + "'";
    }
    delPtr(url);
    payload = serializeDevice(led);
    if (https.begin(*client, urlString)) {
        https.addHeader(String(getPGMString(contentType)), String(getPGMString(applicationJson)));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            String name;
            (led.device == Compressor) ? name = "" : name = led.name;
            Serial.printf_P(PSTR("Состояние %s %s установлено в %s\n"), (led.device == Compressor ? "компрессора" : "прожектора "),
                            (name.c_str()), (led.led.currentState ? "ON" : "OFF"));
        } else {
            Serial.printf_P(PSTR("setCurrentState() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "setCurrentState() -> Невозможно подключиться\n");
    }
}

void putUptime(const String& uptime) {
    char* url = nullptr;
    url = getPGMString(urlPutUptime);
    if (https.begin(*client, String(url))) {
        String payload;
        payload = "{\"uptime\":\"" + uptime + "\"}";
        https.addHeader(String(getPGMString(contentType)), String(getPGMString(applicationJson)));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("putUptime() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "putUptime() -> Невозможно подключиться\n");
    }
    delPtr(url);
}

void uptime() {
    String uptime = uptime_formatter::getUptime();
    Serial.printf_P(PSTR("Время работы устройства: %s\n"), uptime.c_str());
    putUptime(uptime);
}

void putLastOnline(const String& currentTime) {
    char* url = nullptr;
    url = getPGMString(urlPutLastOnline);
    if (https.begin(*client, String(url))) {
        String payload;
        payload = "{\"lastonline\":\"" + currentTime + "\"}";
        https.addHeader(String(getPGMString(contentType)), String(getPGMString(applicationJson)));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("postLastOnline() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "postLastOnline() -> Невозможно подключиться\n");
    }
    delPtr(url);
}

void lastOnline() {
    char* currentTime = clockRTC.dateFormat("H:i:s d.m.Y", clockRTC.getDateTime());
    String payload = String(currentTime);
    putLastOnline(payload);
    free(currentTime);
}

void postBoot() {
    char* url = nullptr;
    char* currentTime = clockRTC.dateFormat("H:i:s d.m.Y", clockRTC.getDateTime());
    url = getPGMString(urlPostBoot);
    if (https.begin(*client, String(url))) {
        String payload;
        payload = "{\"time\":\"" + String(currentTime) + "\"}";
        https.addHeader(String(getPGMString(contentType)), String(getPGMString(applicationJson)));
        int httpCode = https.POST(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("postBoot() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "postBoot() -> Невозможно подключиться\n");
    }
    delPtr(url);
    String message;
    message = "Перезагрузка " + String(currentTime);
    sendMessage(message);
    message.clear();
}

bool checkSettingsForUpdate() {
    // TODO Create method
    return false;
}

void printLedsParam() {
    Serial.printf_P(PSTR("%s\n"), "Настройки прожекторов");
    for (auto& led : leds) {
        Serial.printf_P(PSTR(" Вкл-%02d:%02d. Выкл-%02d:%02d. Состояние: %s. Разрешен: %s. PIN: %d\n"), led.led.HOn, led.led.MOn,
                        led.led.HOff, led.led.MOff, (led.led.currentState ? "включен" : "выключен"),
                        ((led.led.enabled == true) ? "да" : "нет"), led.led.pin

        );
    }
}

void printDosersParam() {
    Serial.printf_P(PSTR("%s\n"), "Настройки дозаторов");
    for (auto& doser : dosersArray) {
        Serial.printf_P(
            PSTR("%d => %s: Вкл %02d:%02d. Pins: dir=%d step=%d enable=%d sleep=%d.\nОбъём: %d. Modes:%d.%d.%d Steps:%d\n"),
            doser.index, doser.name.c_str(), doser.hour, doser.minute, doser.dirPin, doser.stepPin, doser.enablePin, doser.sleepPin,
            doser.volume, doser.mode0_pin, doser.mode1_pin, doser.mode2_pin, doser.steps);
    }
}

void printCompressorParam() {
    Serial.printf_P(PSTR("%s\n"), "Настройки компрессора");
    Serial.printf_P(PSTR(" Вкл-%02d:%02d. Выкл-%02d:%02d. Состояние: %s. Разрешен: %s. PIN: %d\n"), compressor.led.HOn,
                    compressor.led.MOn, compressor.led.HOff, compressor.led.MOff,
                    (compressor.led.currentState ? "включен" : "выключен"), (compressor.led.enabled ? "да" : "нет"),
                    compressor.led.pin

    );
}

void printParams() {
    printLedsParam();
    printDosersParam();
    printCompressorParam();
}

void timer1() {
    char* df = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    Serial.printf_P(PSTR("Сейчас %s\n"), String(df).c_str());
    free(df);
    getSensorsTemperature();

    if (checkSettingsForUpdate()) {
        getParamsBackEnd();
        printParams();
    }

    if (!vectorRefLeds.empty()) {
        for (auto& device : vectorRefLeds) {
            setCurrentState(device);
        }
        vectorRefLeds.clear();
    }
}

String serializeTemperature() {
    String output = "";
    const int capacity = JSON_OBJECT_SIZE(4);
    StaticJsonDocument<capacity> doc;

    char* currentTime = clockRTC.dateFormat("d.m.Y H:i:s", clockRTC.getDateTime());
    doc["sensor1"] = floatToDouble(sensorTemperatureValue1);
    doc["sensor2"] = floatToDouble(sensorTemperatureValue2);
    doc["time"] = currentTime;
    doc["unixtime"] = clockRTC.getDateTime().unixtime;
    serializeJson(doc, output);
    return output;
}

void sendTemperature() {
    char* urlPost = nullptr;
    char* urlPut = nullptr;
    urlPost = getPGMString(urlPostTemperature);
    urlPut = getPGMString(urlPutTemperature);
    String payload = serializeTemperature();

    if (https.begin(*client, String(urlPost))) {
        https.addHeader(String(getPGMString(contentType)), String(getPGMString(applicationJson)));
        int httpCode = https.POST(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.println(F("Значения датчиков температуры отправлены"));
        } else {
            Serial.printf_P(PSTR("postTemperature() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "postTemperature() -> Невозможно подключиться\n");
    }
    delPtr(urlPost);

    if (https.begin(*client, String(urlPut))) {
        https.addHeader(String(getPGMString(contentType)), String(getPGMString(applicationJson)));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("putTemperature() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "putTemperature() -> Невозможно подключиться\n");
    }
    delPtr(urlPut);
    payload.clear();
}

void timer5() {
    uptime();
    lastOnline();
    getSensorsTemperature();
    sendTemperature();
}

void startTimers() {
    Serial.printf_P(PSTR("%s -> %d\n"), "Таймеры: основные", Alarm.count());
    Alarm.timerRepeat(5 * 60, timer5);
    Alarm.timerRepeat(60, timer1);
    Serial.printf_P(PSTR("%s -> %d\n"), "Таймеры: основные и прожекторные", Alarm.count());
}

void setup() {
    Serial.begin(115200);
    Serial.println();

    //  getTemperature();
    initRealTimeClock();
    initLedsArray();
    initDosersArray();
    initCompressor();

    if (!initWiFi()) {
        getParamsEEPROM();
    } else {
        initHTTPClient();
        postBoot();
        getParamsBackEnd();
        syncTime();
        setInternalClock();
        printParams();
    }

    startTimers();
    timer5();
}

// TODO EEPROM чтение и запись

void loop() {
    Alarm.delay(10);
}